# Pandas Module 

- Pandas is one of the library in python which is used for data wrangling , data transformation , data cleaning and many more data operation . 
- Pandas is open source library 
- once you install Anconda , it will install with it 
- for more info [Visit ](https://pandas.pydata.org/docs/reference/index.html)

In [4]:
import pandas as pd

## Read the Excel File using Pandas

In [17]:
## reading the frist sheet of Excel .
df= pd.read_excel(r"C:\Users\prash\Documents\Prashant doc\Study Materials\Dataset\Movie data set\Movie data.xlsx")

In [18]:
## Raed the user define excel sheet

df1=pd.read_excel(r"C:\Users\prash\Documents\Prashant doc\Study Materials\Dataset\Movie data set\Movie data.xlsx",sheet_name='Financial')

# Read all the Sheet from Excel

1. Get the all sheet name of the Excel
2. Then based on your desire

In [22]:
xls=pd.ExcelFile(r"C:\Users\prash\Documents\Prashant doc\Study Materials\Dataset\Movie data set\Movie data.xlsx")

In [24]:
### get the all excel sheet name
xls.sheet_names

['Movie', 'Financial', 'Movie_actor', 'Actor', 'language']

In [25]:
### read the Actor sheet. 
df2=pd.read_excel(xls,sheet_name='Actor')

In [26]:
df2

    actor_id                  name  birth_year
0         50                  Yash        1986
1         51           Sanjay Dutt        1959
2         52  Benedict Cumberbatch        1976
3         53       Elizabeth Olsen        1989
4         54       Chris Hemsworth        1983
..       ...                   ...         ...
62       166       Tommy Lee Jones        1946
63       167        Sebastian Stan        1982
64       168           Anil Kapoor        1956
65       169     Sidharth Malhotra        1985
66       170          Kiara Advani        1991

[67 rows x 3 columns]